import { Languages, LanguageTextsType } from '../types/data/languageTexts';
export const languageTexts: LanguageTextsType = {
  ru: {
    weekDays: {
      fulls: [
      "Воскресенье",
      "Понедельник",
      "Вторник",
      "Среда",
      "Четверг",
      "Пятница",
      "Суббота",
      ],
      shorts: [
        "Вс",
        "Пн",
        "Вт",
        "Ср",
        "Чт",
        "Пт",
        "Сб",
      ]
    },
    months: {
      fulls: [
        "Января",
        "Февраля",
        "Марта",
        "Апреля",
        "Мая",
        "Июня",
        "Июля",
        "Августа",
        "Сентября",
        "Октября",
        "Ноября",
        "Декабря",
      ],
      shorts: [
        "Янв",
        "Фев",
        "Мар",
        "Апр",
        "Май",
        "Июн",
        "Июл",
        "Авг",
        "Сен",
        "Окт",
        "Ноя",
        "Дек",
      ]
    },
    periods: {
      today: 'Сегодня',
      forToday: 'На сегодня',
      tomorrow: 'Завтра',
      forTomorrow: 'На завтра',
      day: 'День',
      days: 'Дни',
      week: 'Неделя',
      forWeek: 'На неделю',
      weeks: 'Недели',
      month: 'Месяц',
      forMonth: 'На месяц',
      months: 'Месяцы',
      year: 'Год',
      years: 'Года',
    },
    languages: {
      en: 'Английский',
      ru: 'Русский',
      ch: 'Чеченский',
      de: 'Немецкий'
    }
  },
  en: {
    weekDays: {
      fulls: [
      "Воскресенье",
      "Понедельник",
      "Вторник",
      "Среда",
      "Четверг",
      "Пятница",
      "Суббота",
      ],
      shorts: [
        "Вс",
        "Пн",
        "Вт",
        "Ср",
        "Чт",
        "Пт",
        "Сб",
      ]
    },
    months: {
      fulls: [
        "Января",
        "Февраля",
        "Марта",
        "Апреля",
        "Мая",
        "Июня",
        "Июля",
        "Августа",
        "Сентября",
        "Октября",
        "Ноября",
        "Декабря",
      ],
      shorts: [
        "Янв",
        "Фев",
        "Мар",
        "Апр",
        "Май",
        "Июн",
        "Июл",
        "Авг",
        "Сен",
        "Окт",
        "Ноя",
        "Дек",
      ]
    },
    periods: {
      today: 'Сегодня',
      tomorrov: '',
      day: '',
      days: '',
      week: '',
      weeks: '',
      month: '',
      months: '',
      year: '',
      years: '',
    },
    languages: {
      en: 'Английский',
      ru: 'Русский',
      ch: 'Чеченский',
      de: 'Немецкий'
    }
  },
  de: {
    weekDays: {
      fulls: [
      "Воскресенье",
      "Понедельник",
      "Вторник",
      "Среда",
      "Четверг",
      "Пятница",
      "Суббота",
      ],
      shorts: [
        "Вс",
        "Пн",
        "Вт",
        "Ср",
        "Чт",
        "Пт",
        "Сб",
      ]
    },
    months: {
      fulls: [
        "Января",
        "Февраля",
        "Марта",
        "Апреля",
        "Мая",
        "Июня",
        "Июля",
        "Августа",
        "Сентября",
        "Октября",
        "Ноября",
        "Декабря",
      ],
      shorts: [
        "Янв",
        "Фев",
        "Мар",
        "Апр",
        "Май",
        "Июн",
        "Июл",
        "Авг",
        "Сен",
        "Окт",
        "Ноя",
        "Дек",
      ]
    },
    periods: {
      today: 'Сегодня',
      tomorrov: '',
      day: '',
      days: '',
      week: '',
      weeks: '',
      month: '',
      months: '',
      year: '',
      years: '',
    },
    languages: {
      en: 'Английский',
      ru: 'Русский',
      ch: 'Чеченский',
      de: 'Немецкий'
    }
  },
  ch: {
    weekDays: {
      fulls: [
      "Воскресенье",
      "Понедельник",
      "Вторник",
      "Среда",
      "Четверг",
      "Пятница",
      "Суббота",
      ],
      shorts: [
        "Вс",
        "Пн",
        "Вт",
        "Ср",
        "Чт",
        "Пт",
        "Сб",
      ]
    },
    months: {
      fulls: [
        "Января",
        "Февраля",
        "Марта",
        "Апреля",
        "Мая",
        "Июня",
        "Июля",
        "Августа",
        "Сентября",
        "Октября",
        "Ноября",
        "Декабря",
      ],
      shorts: [
        "Янв",
        "Фев",
        "Мар",
        "Апр",
        "Май",
        "Июн",
        "Июл",
        "Авг",
        "Сен",
        "Окт",
        "Ноя",
        "Дек",
      ]
    },
    periods: {
      today: 'Сегодня',
      tomorrov: '',
      day: '',
      days: '',
      week: '',
      weeks: '',
      month: '',
      months: '',
      year: '',
      years: '',
    },
    languages: {
      en: 'Английский',
      ru: 'Русский',
      ch: 'Чеченский',
      de: 'Немецкий'
    }
  },
}

export const lagnuages: Array<keyof Languages> = ['ch', 'en', 'ru', 'de'];